//let offer = {"usid":1069080,"usn":"Кібербезпека","ustn":"Відкрита","uid":104,"un":"Національний технічний університет \"Харківський політехнічний інститут\"","ufn":"Навчально-науковий інститут комп’ютерних наук та інформаційних технологій","rk":"1.07","qid":"1","qn":"Бакалавр","ebid":40,"ebn":"Повна загальна середня освіта","efid":1,"efn":"Денна","cid":1,"ssc":"125","ssn":"Кібербезпека","etrm":"12.09.2022 &ndash; 30.06.2026 (3р 10м)","rtrm":"29.07.2022 &ndash; 23.08.2022","price":"30470","up":1,"spn":"Кібербезпека","ox":25,"ol":75,"oc":50,"rr":1,"osn":{"1":{"n":"1","i":[689215]},"2":{"n":"2","i":[696671]},"3":{"n":"3","i":[695617]},"4":{"n":"4","i":[975796]},"5":{"n":"5","i":[975804]},"6":{"n":"6","i":[975807,975811,975816,975820,975824,975830]},"12":{"i":[836994]}},"os":{"689215":{"sn":"Українська мова","k":0.3,"efid":3,"t":"Сертифікат НМТ","icon":"3n","ch":0,"mv":100},"696671":{"sn":"Математика","k":0.5,"efid":3,"t":"Сертифікат НМТ","icon":"3n","ch":0,"mv":100},"695617":{"sn":"Історія України","k":0.2,"efid":3,"t":"Сертифікат НМТ","icon":"3n","ch":0,"mv":100},"975796":{"sn":"Українська мова","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":0,"mv":100},"975804":{"sn":"Математика","k":0.5,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":0,"mv":100},"975807":{"sn":"Іноземна мова","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"975811":{"sn":"Історія України","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"975816":{"sn":"Біологія","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"975820":{"sn":"Географія","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"975824":{"sn":"Фізика","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"975830":{"sn":"Хімія","k":0.2,"efid":3,"t":"Сертифікат ЗНО 2019-2021 року","icon":"3","ch":1,"mv":100},"836994":{"sn":"Мотиваційний лист","k":0,"efid":100,"t":"","icon":100,"ch":0}},"st":{"c":{"t":197,"a":182,"b":170,"ka":177.5,"km":136.2,"kx":200,"r":0,"ob":0,"oc":0,"rm":null,"obm":null,"ocm":null}},"shf":1,"hr":0}


/*
(async() => {

    const params = new URLSearchParams();

    params.append('id', '1069038');
    params.append('last', '0');

    axios.post('https://vstup.edbo.gov.ua/offer-requests/', params,
        {
            headers: {
                'Referer': 'https://vstup.edbo.gov.ua/offer/1069038/',
                'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8'
            }
        })
        .then(function (response) {
            console.log(response.data.requests.length);
        })
        .catch(function (error) {
            console.log(error);
        });
})()*/

import {Axios, AxiosError} from "axios";

interface Request {
    priorityId: number, //prid
    priorityNumber: number, //p
    status: Status, //prsid
    personTitle: string, //fio
    score: number, //kv
    hasQuota: boolean //rss
    /**
     *  rss: [
     *     { kv: '+56.100', f: '187 x 0.3', id: 697173 },
     *     { kv: '+100.000', f: '200 x 0.5', id: 695610 },
     *     { kv: '+38.400', f: '192 x 0.2', id: 696665 },
     *     { kv: 'x1.07', t: 'rk' },
     *     { kv: '', t: 'q', sn: 'Квота 2' }
     *   ]
     */
}

interface Status {
    id: number,
    name: string
}

class RequestStatuses {
    protected statuses: Status[] = [];

    constructor() {
        this.parseStatuses();
    }

    protected parseStatuses(): void {
        const rawStatuses = {
            "1":"заява надійшла з сайту",
            "2":"затримано",
            "3":"скасовано вступником",
            "4":"скасовано (втрата пріор.)",
            "5":"зареєстровано",
            "6":"допущено",
            "7":"відмова",
            "8":"скасовано ЗО",
            "9":"рекомендовано (бюджет)",
            "10":"відхилено (бюджет)",
            "11":"допущено (контракт, за ріш. ПК)",
            "12":"рекомендовано (контракт)",
            "13":"відхилено (контракт)",
            "14":"до наказу",
            "15":"відраховано",
            "16":"скасовано (зарах. на бюджет)"
        }

        for (const rawStatus of Object.entries(rawStatuses)) {

            const status: Status = {
                id: parseInt(rawStatus[0]),
                name: rawStatus[1],
            }

            this.statuses.push(status);
        }
    }

    public getStatusById(id: number): Status | null {
        const status = this.statuses.find(status => {
            return status.id === id;
        });

        return status ?? null;
    }
}

class EDBO {
    protected axios: Axios;

    protected OFFER_ENDPOINT = 'https://vstup.edbo.gov.ua/offer-requests/';

    protected OFFER_HEADERS = {
        'Referer': 'https://vstup.edbo.gov.ua/offer/',
        'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8',
        'Accept': 'application/json, text/javascript, */*; q=0.01',
        'Accept-Language': 'ru-RU,ru;q=0.9,en-US;q=0.8,en;q=0.7',
        'Connection': 'keep-alive',
        'Origin': 'https://vstup.edbo.gov.ua',
        'Sec-Fetch-Dest': 'empty',
        'Sec-Fetch-Mode': 'cors',
        'Sec-Fetch-Site': 'same-origin',
        'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36',
        'X-Requested-With': 'XMLHttpRequest',
        'sec-ch-ua': '".Not/A)Brand";v="99", "Google Chrome";v="103", "Chromium";v="103"',
        'sec-ch-ua-mobile': "?0",
        'sec-ch-ua-platform': "macOS"
    }

    constructor() {
        this.axios = require('axios').default;
    }

    async getRequestsByOfferId(offedId: number): Promise<String[]> {
        const params = new URLSearchParams();

        params.append('id', offedId.toString());
        params.append('last', '0');

        this.OFFER_HEADERS.Referer += offedId + '/';


        const result = [];
        try {
            const response = await this.axios.post(this.OFFER_ENDPOINT, params,
                {
                    headers: this.OFFER_HEADERS
                });

            if (response.data.requests.length > 0) {
                result.push('test');
            }

        //} catch (error: AxiosError) {
        } catch (error: any) {
            throw new Error(`Request error. Details: ${error.message}`)
        }

        return result;
    }

    transformRawData(rawData: Test) {
        const request = {
            priorityId: rawData.prid,
            // priorityNumber: 0,
            // status: undefined,
            // personTitle: "",
            // score: 0,
            // hasQuota: false
        }

        return request;
    }
}

interface Test {
    prid: number,
    n: number,
    prsid: number,
    ptid: number,
    fio: string,
    pa: number,
    d: number,
    artid: number,
    kv: number,
    p: number,
    rss: [

    ]

}

interface Types {

}

interface RegionCoefficient {

}

const response = [
    {
        "prid": 10483854,
        "n": 201,
        "prsid": 6,
        "ptid": 0,
        "fio": "Папушин М. А.",
        "pa": 0,
        "d": 0, //Подано оригінали документів
        "artid": 0,
        "kv": 162.759, //Конкурсний бал
        "p": 2, // Приоритет
        "rss": [ // Показники – Коефіцієнти – Предмети
            {
                "kv": "+40.750",
                "f": "163 x 0.25",
                "id": 970655
            },
            {
                "kv": "+56.400",
                "f": "141 x 0.4",
                "id": 970675
            },
            {
                "kv": "+39.750",
                "f": "159 x 0.25",
                "id": 970718
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10733157,
        "n": 202,
        "prsid": 6,
        "ptid": 0,
        "fio": "Пітінов Я. П.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 162.533,
        "p": 1,
        "rss": [
            {
                "kv": "+44.100",
                "f": "147 x 0.3",
                "id": 688807
            },
            {
                "kv": "+78.000",
                "f": "156 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.800",
                "f": "149 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10675935,
        "n": 203,
        "prsid": 6,
        "ptid": 0,
        "fio": "Кикоть Д. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 161.142,
        "p": 0,
        "rss": [
            {
                "kv": "+47.100",
                "f": "157 x 0.3",
                "id": 688807
            },
            {
                "kv": "+75.500",
                "f": "151 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.000",
                "f": "140 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10524247,
        "n": 204,
        "prsid": 6,
        "ptid": 0,
        "fio": "Старова А. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 160.179,
        "p": 1,
        "rss": [
            {
                "kv": "+43.500",
                "f": "145 x 0.3",
                "id": 688807
            },
            {
                "kv": "+76.000",
                "f": "152 x 0.5",
                "id": 696525
            },
            {
                "kv": "+30.200",
                "f": "151 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10717942,
        "n": 205,
        "prsid": 6,
        "ptid": 0,
        "fio": "Супрун Б. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 159.858,
        "p": 3,
        "rss": [
            {
                "kv": "+48.000",
                "f": "160 x 0.3",
                "id": 688807
            },
            {
                "kv": "+72.000",
                "f": "144 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.400",
                "f": "147 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10702404,
        "n": 206,
        "prsid": 6,
        "ptid": 0,
        "fio": "Крамаренко К. Г.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 159.216,
        "p": 1,
        "rss": [
            {
                "kv": "+43.500",
                "f": "145 x 0.3",
                "id": 688807
            },
            {
                "kv": "+75.500",
                "f": "151 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.800",
                "f": "149 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10674626,
        "n": 207,
        "prsid": 6,
        "ptid": 0,
        "fio": "Алексєйцев Д. Д.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 159.002,
        "p": 1,
        "rss": [
            {
                "kv": "+46.200",
                "f": "154 x 0.3",
                "id": 688807
            },
            {
                "kv": "+73.000",
                "f": "146 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.400",
                "f": "147 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10735250,
        "n": 208,
        "prsid": 6,
        "ptid": 0,
        "fio": "Пирожок С. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 158.253,
        "p": 1,
        "rss": [
            {
                "kv": "+47.100",
                "f": "157 x 0.3",
                "id": 688807
            },
            {
                "kv": "+71.000",
                "f": "142 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.800",
                "f": "149 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10707197,
        "n": 209,
        "prsid": 6,
        "ptid": 0,
        "fio": "Лісненко М. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 156.327,
        "p": 1,
        "rss": [
            {
                "kv": "+44.700",
                "f": "149 x 0.3",
                "id": 688807
            },
            {
                "kv": "+73.000",
                "f": "146 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.400",
                "f": "142 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10738221,
        "n": 210,
        "prsid": 6,
        "ptid": 0,
        "fio": "Яремченко Б. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 155.899,
        "p": 1,
        "rss": [
            {
                "kv": "+45.300",
                "f": "151 x 0.3",
                "id": 688807
            },
            {
                "kv": "+71.000",
                "f": "142 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.400",
                "f": "147 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10725784,
        "n": 211,
        "prsid": 6,
        "ptid": 0,
        "fio": "Мауріна К. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 155.257,
        "p": 0,
        "rss": [
            {
                "kv": "+42.600",
                "f": "142 x 0.3",
                "id": 688807
            },
            {
                "kv": "+74.500",
                "f": "149 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.000",
                "f": "140 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10524503,
        "n": 212,
        "prsid": 6,
        "ptid": 0,
        "fio": "Голясіна Л. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 155.043,
        "p": 1,
        "rss": [
            {
                "kv": "+47.100",
                "f": "157 x 0.3",
                "id": 688807
            },
            {
                "kv": "+68.000",
                "f": "136 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.800",
                "f": "149 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10735314,
        "n": 213,
        "prsid": 6,
        "ptid": 0,
        "fio": "Слота А. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 154.401,
        "p": 3,
        "rss": [
            {
                "kv": "+42.600",
                "f": "142 x 0.3",
                "id": 688807
            },
            {
                "kv": "+75.500",
                "f": "151 x 0.5",
                "id": 696525
            },
            {
                "kv": "+26.200",
                "f": "131 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10575085,
        "n": 214,
        "prsid": 6,
        "ptid": 0,
        "fio": "Єрмоленко В. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 153.117,
        "p": 1,
        "rss": [
            {
                "kv": "+44.700",
                "f": "149 x 0.3",
                "id": 688807
            },
            {
                "kv": "+70.000",
                "f": "140 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.400",
                "f": "142 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10750789,
        "n": 215,
        "prsid": 6,
        "ptid": 0,
        "fio": "Семьонов М. А.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 152.903,
        "p": 4,
        "rss": [
            {
                "kv": "+43.500",
                "f": "145 x 0.3",
                "id": 688807
            },
            {
                "kv": "+71.000",
                "f": "142 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.400",
                "f": "142 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10759081,
        "n": 216,
        "prsid": 6,
        "ptid": 0,
        "fio": "Малінніков І. П.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 151.833,
        "p": 5,
        "rss": [
            {
                "kv": "+43.500",
                "f": "145 x 0.3",
                "id": 688807
            },
            {
                "kv": "+70.000",
                "f": "140 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.400",
                "f": "142 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10572649,
        "n": 217,
        "prsid": 6,
        "ptid": 0,
        "fio": "Лебідь А. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 151.405,
        "p": 1,
        "rss": [
            {
                "kv": "+38.700",
                "f": "129 x 0.3",
                "id": 688807
            },
            {
                "kv": "+74.000",
                "f": "148 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.800",
                "f": "144 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10560957,
        "n": 218,
        "prsid": 6,
        "ptid": 0,
        "fio": "Ященко Я. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 149.479,
        "p": 1,
        "rss": [
            {
                "kv": "+41.700",
                "f": "139 x 0.3",
                "id": 688807
            },
            {
                "kv": "+70.000",
                "f": "140 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.000",
                "f": "140 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10725322,
        "n": 219,
        "prsid": 6,
        "ptid": 0,
        "fio": "Табунов Р. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 146.911,
        "p": 2,
        "rss": [
            {
                "kv": "+40.500",
                "f": "135 x 0.3",
                "id": 688807
            },
            {
                "kv": "+70.000",
                "f": "140 x 0.5",
                "id": 696525
            },
            {
                "kv": "+26.800",
                "f": "134 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10737244,
        "n": 220,
        "prsid": 6,
        "ptid": 0,
        "fio": "Сорока Д. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 143.273,
        "p": 2,
        "rss": [
            {
                "kv": "+41.100",
                "f": "137 x 0.3",
                "id": 688807
            },
            {
                "kv": "+64.000",
                "f": "128 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.800",
                "f": "144 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10535601,
        "n": 221,
        "prsid": 6,
        "ptid": 0,
        "fio": "Гранатюк О. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 137.923,
        "p": 3,
        "rss": [
            {
                "kv": "+40.500",
                "f": "135 x 0.3",
                "id": 688807
            },
            {
                "kv": "+59.000",
                "f": "118 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.400",
                "f": "147 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10492228,
        "n": 222,
        "prsid": 6,
        "ptid": 0,
        "fio": "Слета А. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 122.872,
        "p": 0,
        "rss": [
            {
                "kv": "+26.750",
                "f": "107 x 0.25",
                "id": 970655
            },
            {
                "kv": "+47.600",
                "f": "119 x 0.4",
                "id": 970675
            },
            {
                "kv": "+29.000",
                "f": "116 x 0.25",
                "id": 970745
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10526092,
        "n": 223,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-7934400  Д. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 197.308,
        "p": 1,
        "rss": [
            {
                "kv": "+56.400",
                "f": "188 x 0.3",
                "id": 688807
            },
            {
                "kv": "+95.000",
                "f": "190 x 0.5",
                "id": 696525
            },
            {
                "kv": "+33.000",
                "f": "165 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10681414,
        "n": 224,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8086001  М. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 195.596,
        "p": 1,
        "rss": [
            {
                "kv": "+58.500",
                "f": "195 x 0.3",
                "id": 688807
            },
            {
                "kv": "+92.500",
                "f": "185 x 0.5",
                "id": 696525
            },
            {
                "kv": "+31.800",
                "f": "159 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10586836,
        "n": 225,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8079337  К. А.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 188.32,
        "p": 1,
        "rss": [
            {
                "kv": "+54.000",
                "f": "180 x 0.3",
                "id": 688807
            },
            {
                "kv": "+85.000",
                "f": "170 x 0.5",
                "id": 696525
            },
            {
                "kv": "+37.000",
                "f": "185 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10795878,
        "n": 226,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8016047  В. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 146.697,
        "p": 4,
        "rss": [
            {
                "kv": "+39.900",
                "f": "133 x 0.3",
                "id": 688807
            },
            {
                "kv": "+68.000",
                "f": "136 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.200",
                "f": "146 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10640458,
        "n": 227,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8017646  Д. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10726060,
        "n": 228,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8028161  О. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10712622,
        "n": 229,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8096802  І. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10683098,
        "n": 230,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8092456  В. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10593381,
        "n": 231,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8060472  А. Д.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10548059,
        "n": 232,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-7997058  Н. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10526441,
        "n": 233,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-7957399  Д. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10524071,
        "n": 234,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8060264  І. І.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 2,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10695512,
        "n": 235,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8089443  А. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 2,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10744224,
        "n": 236,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-6319690  Я. Д.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 2,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10613148,
        "n": 237,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8027068  В. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 2,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10612797,
        "n": 238,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8076611  С. М.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 2,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10656205,
        "n": 239,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-7899194  А. Є.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 3,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10723872,
        "n": 240,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8072852  М. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 3,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10549721,
        "n": 241,
        "prsid": 5,
        "ptid": 0,
        "fio": "104-8037105  Я. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 4,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10787920,
        "n": 242,
        "prsid": 5,
        "ptid": 0,
        "fio": "Рудюк М. М.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 156.969,
        "p": 3,
        "rss": [
            {
                "kv": "+44.100",
                "f": "147 x 0.3",
                "id": 688807
            },
            {
                "kv": "+75.000",
                "f": "150 x 0.5",
                "id": 696525
            },
            {
                "kv": "+27.600",
                "f": "138 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10786604,
        "n": 243,
        "prsid": 5,
        "ptid": 0,
        "fio": "Єременко А. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 147.767,
        "p": 0,
        "rss": [
            {
                "kv": "+42.900",
                "f": "143 x 0.3",
                "id": 688807
            },
            {
                "kv": "+68.000",
                "f": "136 x 0.5",
                "id": 696525
            },
            {
                "kv": "+27.200",
                "f": "136 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10832758,
        "n": 244,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-8041357  Ю. П.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 198.164,
        "p": 4,
        "rss": [
            {
                "kv": "+55.200",
                "f": "184 x 0.3",
                "id": 688807
            },
            {
                "kv": "+90.000",
                "f": "180 x 0.5",
                "id": 696525
            },
            {
                "kv": "+40.000",
                "f": "200 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10837097,
        "n": 245,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-7970956  М. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 195.596,
        "p": 2,
        "rss": [
            {
                "kv": "+54.000",
                "f": "180 x 0.3",
                "id": 688807
            },
            {
                "kv": "+96.000",
                "f": "192 x 0.5",
                "id": 696525
            },
            {
                "kv": "+32.800",
                "f": "164 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10799459,
        "n": 246,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-7990738  Д. Ю.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 191.102,
        "p": 3,
        "rss": [
            {
                "kv": "+54.000",
                "f": "180 x 0.3",
                "id": 688807
            },
            {
                "kv": "+90.000",
                "f": "180 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.600",
                "f": "173 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10772730,
        "n": 247,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-7947458  М. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 185.11,
        "p": 3,
        "rss": [
            {
                "kv": "+54.600",
                "f": "182 x 0.3",
                "id": 688807
            },
            {
                "kv": "+86.000",
                "f": "172 x 0.5",
                "id": 696525
            },
            {
                "kv": "+32.400",
                "f": "162 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10842581,
        "n": 248,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-8036552  С. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 178.262,
        "p": 5,
        "rss": [
            {
                "kv": "+51.600",
                "f": "172 x 0.3",
                "id": 688807
            },
            {
                "kv": "+81.000",
                "f": "162 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.000",
                "f": "170 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10842362,
        "n": 249,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-8038495  О. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 177.941,
        "p": 4,
        "rss": [
            {
                "kv": "+51.600",
                "f": "172 x 0.3",
                "id": 688807
            },
            {
                "kv": "+79.500",
                "f": "159 x 0.5",
                "id": 696525
            },
            {
                "kv": "+35.200",
                "f": "176 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10814301,
        "n": 250,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-8087494  А. М.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 169.06,
        "p": 2,
        "rss": [
            {
                "kv": "+48.900",
                "f": "163 x 0.3",
                "id": 688807
            },
            {
                "kv": "+79.500",
                "f": "159 x 0.5",
                "id": 696525
            },
            {
                "kv": "+29.600",
                "f": "148 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10805094,
        "n": 251,
        "prsid": 1,
        "ptid": 0,
        "fio": "104-8086344  Я. М.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 163.175,
        "p": 3,
        "rss": [
            {
                "kv": "+39.900",
                "f": "133 x 0.3",
                "id": 688807
            },
            {
                "kv": "+78.000",
                "f": "156 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.600",
                "f": "173 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10844076,
        "n": 252,
        "prsid": 1,
        "ptid": 0,
        "fio": "Гладишев А. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 200,
        "p": 5,
        "rss": [
            {
                "kv": "+53.100",
                "f": "177 x 0.3",
                "id": 688807
            },
            {
                "kv": "+100.000",
                "f": "200 x 0.5",
                "id": 696525
            },
            {
                "kv": "+40.000",
                "f": "200 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10814097,
        "n": 253,
        "prsid": 1,
        "ptid": 0,
        "fio": "Прокопенко О. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 196.88,
        "p": 4,
        "rss": [
            {
                "kv": "+53.100",
                "f": "177 x 0.3",
                "id": 688807
            },
            {
                "kv": "+92.500",
                "f": "185 x 0.5",
                "id": 696525
            },
            {
                "kv": "+38.400",
                "f": "192 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10837881,
        "n": 254,
        "prsid": 1,
        "ptid": 0,
        "fio": "Гаркуша Ю. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 195.917,
        "p": 5,
        "rss": [
            {
                "kv": "+52.200",
                "f": "174 x 0.3",
                "id": 688807
            },
            {
                "kv": "+92.500",
                "f": "185 x 0.5",
                "id": 696525
            },
            {
                "kv": "+38.400",
                "f": "192 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10841183,
        "n": 255,
        "prsid": 1,
        "ptid": 0,
        "fio": "Маклаков Д. А.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 189.747,
        "p": 3,
        "rss": [
            {
                "kv": "+45.500",
                "f": "182 x 0.25",
                "id": 970655
            },
            {
                "kv": "+69.600",
                "f": "174 x 0.4",
                "id": 970675
            },
            {
                "kv": "+44.500",
                "f": "178 x 0.25",
                "id": 970701
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10762426,
        "n": 256,
        "prsid": 1,
        "ptid": 0,
        "fio": "Калюжний М. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 189.604,
        "p": 1,
        "rss": [
            {
                "kv": "+55.200",
                "f": "184 x 0.3",
                "id": 688807
            },
            {
                "kv": "+88.000",
                "f": "176 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.000",
                "f": "170 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10848861,
        "n": 257,
        "prsid": 1,
        "ptid": 0,
        "fio": "Діденко В. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 187.892,
        "p": 5,
        "rss": [
            {
                "kv": "+51.600",
                "f": "172 x 0.3",
                "id": 688807
            },
            {
                "kv": "+90.000",
                "f": "180 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.000",
                "f": "170 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10770770,
        "n": 258,
        "prsid": 1,
        "ptid": 0,
        "fio": "Клочкова М. Р.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 182.863,
        "p": 1,
        "rss": [
            {
                "kv": "+48.900",
                "f": "163 x 0.3",
                "id": 688807
            },
            {
                "kv": "+90.000",
                "f": "180 x 0.5",
                "id": 696525
            },
            {
                "kv": "+32.000",
                "f": "160 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10828909,
        "n": 259,
        "prsid": 1,
        "ptid": 0,
        "fio": "Кобозева В. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 178.69,
        "p": 1,
        "rss": [
            {
                "kv": "+52.200",
                "f": "174 x 0.3",
                "id": 688807
            },
            {
                "kv": "+84.000",
                "f": "168 x 0.5",
                "id": 696525
            },
            {
                "kv": "+30.800",
                "f": "154 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10801175,
        "n": 260,
        "prsid": 1,
        "ptid": 0,
        "fio": "Оленченков І. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 174.838,
        "p": 2,
        "rss": [
            {
                "kv": "+54.600",
                "f": "182 x 0.3",
                "id": 688807
            },
            {
                "kv": "+78.000",
                "f": "156 x 0.5",
                "id": 696525
            },
            {
                "kv": "+30.800",
                "f": "154 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10846828,
        "n": 261,
        "prsid": 1,
        "ptid": 0,
        "fio": "Ковалик В. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 163.389,
        "p": 2,
        "rss": [
            {
                "kv": "+44.100",
                "f": "147 x 0.3",
                "id": 688807
            },
            {
                "kv": "+78.000",
                "f": "156 x 0.5",
                "id": 696525
            },
            {
                "kv": "+30.600",
                "f": "153 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10759616,
        "n": 262,
        "prsid": 1,
        "ptid": 0,
        "fio": "Кисличко Г. Є.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 152.903,
        "p": 1,
        "rss": [
            {
                "kv": "+41.100",
                "f": "137 x 0.3",
                "id": 688807
            },
            {
                "kv": "+73.000",
                "f": "146 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.800",
                "f": "144 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10847550,
        "n": 263,
        "prsid": 1,
        "ptid": 0,
        "fio": "Шмакова А. Д.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 152.368,
        "p": 4,
        "rss": [
            {
                "kv": "+45.300",
                "f": "151 x 0.3",
                "id": 688807
            },
            {
                "kv": "+65.500",
                "f": "131 x 0.5",
                "id": 696525
            },
            {
                "kv": "+31.600",
                "f": "158 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10847093,
        "n": 264,
        "prsid": 1,
        "ptid": 0,
        "fio": "Гнатюк А. Д.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 152.261,
        "p": 1,
        "rss": [
            {
                "kv": "+45.300",
                "f": "151 x 0.3",
                "id": 688807
            },
            {
                "kv": "+69.000",
                "f": "138 x 0.5",
                "id": 696525
            },
            {
                "kv": "+28.000",
                "f": "140 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    },
    {
        "prid": 10521812,
        "n": 265,
        "prsid": 7,
        "ptid": 0,
        "fio": "104-7979973  М. Є.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 200,
        "p": 1,
        "rss": [
            {
                "kv": "+54.000",
                "f": "180 x 0.3",
                "id": 688807
            },
            {
                "kv": "+100.000",
                "f": "200 x 0.5",
                "id": 696525
            },
            {
                "kv": "+33.000",
                "f": "165 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10521511,
        "n": 266,
        "prsid": 8,
        "ptid": 0,
        "fio": "104-6242830  А. С.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 183.077,
        "p": 2,
        "rss": [
            {
                "kv": "+52.800",
                "f": "176 x 0.3",
                "id": 688807
            },
            {
                "kv": "+83.500",
                "f": "167 x 0.5",
                "id": 696525
            },
            {
                "kv": "+34.800",
                "f": "174 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10544683,
        "n": 267,
        "prsid": 8,
        "ptid": 0,
        "fio": "104-7971272  Н. В.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 0,
        "p": 1,
        "rss": [
            {
                "kv": "x1.07",
                "t": "rk"
            },
            {
                "kv": "",
                "t": "q",
                "sn": "Квота 2"
            }
        ]
    },
    {
        "prid": 10548088,
        "n": 268,
        "prsid": 4,
        "ptid": 0,
        "fio": "Корнев В. О.",
        "pa": 0,
        "d": 0,
        "artid": 0,
        "kv": 158.039,
        "p": 0,
        "rss": [
            {
                "kv": "+44.700",
                "f": "149 x 0.3",
                "id": 688807
            },
            {
                "kv": "+73.000",
                "f": "146 x 0.5",
                "id": 696525
            },
            {
                "kv": "+30.000",
                "f": "150 x 0.2",
                "id": 695349
            },
            {
                "kv": "x1.07",
                "t": "rk"
            }
        ]
    }
]

// const edbo = new EDBO();
// response.forEach(item => {
//     console.log(edbo.transformRawData(item));
// })